Revit 2027 API
SystemZoneElementType.HeatingAirTemperature Property
 The heating air temperature in unit Kelvin (K).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HeatingAirTemperature { get; set; }
Public Property HeatingAirTemperature As Double
	Get
	Set
public:
property double HeatingAirTemperature {
	double get ();
	void set (double value);
}
member HeatingAirTemperature : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property:
See Also
Reference
SystemZoneElementType Class
Autodesk.Revit.DB.Mechanical Namespace